---
title: "Project - NoSQL Migration"
author: "Jose Zuniga"
output:
  html_document:
    toc: yes
    toc_depth: '3'
  pdf_document:
    toc: yes
    toc_depth: '3'
---

```{r setup, include=FALSE}
knitr::opts_chunk$set(echo = TRUE)
```

# Project Instructions

Take information from a relational database and migrate it to a NoSQL database. The relational database can be the *flights* database, the *tb* database, the *data skills* database from Project 3, or any another database. The NoSQL database can be *MongoDB*, *Neo4j*, or any another NoSQL database. The migration process needs to be reproducible. `R` code is encouraged, but not required. Also briefly describe the advantages and disadvantages of storing the data in a relational database versus a NoSQL database.

# Pull Data from Relational Database

```{r echo=FALSE}
MySQL_Username <- "root"
MySQL_Password <- "1010"
op <- options()
options(max.print=10)
```
```{r message=FALSE, warning=FALSE}
library(RMySQL)
```
```{r cache=TRUE}
connection <- dbConnect(MySQL(), user=MySQL_Username, password=MySQL_Password)
dbSendQuery(connection, 'USE Flights;')
Airlines <- dbGetQuery(connection, "SELECT * FROM Airlines;")
Airports <- dbGetQuery(connection, "SELECT * FROM Airports;")
Flights <- dbGetQuery(connection, "SELECT * FROM Flights;")
Planes <- dbGetQuery(connection, "SELECT * FROM Planes;")
Weather <- dbGetQuery(connection, "SELECT * FROM Weather;")
dbDisconnect(connection)
```

# Migrate to NoSQL Database

## MongoDB

The **mongolite** package is more efficient than the **RMongo** package which requires conversion to `JSON`, string manipulation, and several lines of additional code using the below functions:

    library(jsonlite)
    library(RMongo)
    convert <- function(x){
      JSON <- toJSON(x)
      JSON <- gsub("\\[", "{", JSON)
      JSON <- gsub("\\]", "}", JSON)
      JSON <- as.character(JSON)
      return(JSON)
    }
    mongodb <- mongoDbConnect("Flights", host = "localhost", port = 27017)
    dbInsertDocument(mongodb, 'Table', convert(Table))
    dbShowCollections(mongodb)
    dbGetQuery(mongodb, "Table", "{}")
    dbRemoveQuery(mongodb, 'Table', convert(Table))\
    dbDisconnect(mongodb)

An empty query filter document ({}) selects all documents in the collection.
```{r message=FALSE, warning=FALSE}
library(mongolite)
```
```{r}
mongodb <- mongo(collection = "Flights")
mongodb$insert(Airlines)
mongodb$insert(Airports)
mongodb$insert(Flights, pagesize = 100000)
mongodb$insert(Planes)
mongodb$insert(Weather)
mongodb$count()
mongodb$drop()
mongodb$count()
rm(mongodb)
```
The connection through **mongolite** automatically disconnects when the connection is removed.

## Neo4j

A *Neo4j* database must be up and running in order to use **RNeo4j**. The **RNeo4j** `createNode` function returns a "collections containing mixed types cannot be stored in properties" error when nulls exist in the data. The function `unmix` changes nulls to the string "`NA`" as a work around. The *Flights* table is rather large with `r nrow(Flights)` rows and returns either a "Server error: (500) Internal Server Error" or a "Java heap space" error due the memory constraints on this machine. The function has been limited to the first $10^5$ rows for the sake of this assignment.
```{r message=FALSE, warning=FALSE}
library(RNeo4j)
# system('"C:/Program Files/Neo4j CE 3.0.7/bin/neo4j-ce.exe"')
unmix <- function(x) { x[is.na(x)] <- "NA"; return(x) }
```
```{r}
graph = startGraph("http://localhost:7474/db/data/")
clear(graph, input = FALSE)
createNode(graph, "Airlines", unmix(Airlines))
createNode(graph, "Airports", unmix(Airports))
createNode(graph, "Flights", unmix(Flights[1:10^5, ]))
createNode(graph, "Planes", unmix(Planes))
createNode(graph, "Weather", unmix(Weather))
options(op)
(query <- cypher(graph, "MATCH (n) RETURN COUNT(n)"))
clear(graph, input = FALSE)
```
```{r echo=FALSE}
options(op)
```

# Comparison

<center>**Column-based versus Row-based Storage**</center>
<center><br>![](http://1.bp.blogspot.com/-6jBw9eigO3c/URSBQh1WmMI/AAAAAAAAAXI/RVqNWUGQ35U/s640/sharding-comparison.png)<br><br></center>

|RDBMS                                |NoSQL                              |
|:-----------------------------------:|:---------------------------------:|
|MySQL, Postgres, Oracle Database     |MongoDB, Cassandra, HBase, Neo4j   |
|Relational schema                    |Schema-free                        |
|Strong Consistency                   |Strong/Eventual Consistency        |
|Stores individual records            |Storage model Varies               |
|Scalable reads                       |Scalable writes/reads              |
|Custom high-availability (Vertical)  |Auto high-availability (Horizontal)|
|Flexible queries (SQL)               |Limited queries (APIs)             |
|Closed/open source                   |Open source                        |
|Supports transactions                |Transactions may be limited        |
|ACID                                 |BASE                               |

Most NoSQL databases are designed more for performance than data integrity. NoSQL databases do not have a relational schema like the standard RDMS. This has an impact on the consistency of the NoSQL databases. RDMS data is stored as individual records, but NoSQL databases have various models including models that "do away with the table-and-row model altogether" which can help boost performance. NoSQL databases are better for data that requires a lot of reads and writes. NoSQL databases automatically provide auto high-availability and disaster recovery by auto-sharding (partitioning) across many server instances. NoSQL databases have very limited query abilities however. The open-source development model of NoSQL can be considered both an advantage and disadvantage with arguments for reach being outside the scope of this comparison. Lastly, update transactions can be limited in NoSQL databases. 

<center>**Different Data Storage Models**</center>
<center>![](https://kvaes.files.wordpress.com/2015/01/1401269083847.jpg)</center>

# References

https://www.mongodb.com/nosql-inline

http://dataconomy.com/sql-vs-nosql-need-know/

https://www.devbridge.com/articles/benefits-of-nosql/

https://cran.r-project.org/web/packages/RMongo/RMongo.pdf

https://docs.mongodb.com/v3.2/tutorial/query-documents/

https://neo4j.com/developer/r/

https://neo4j.com/blog/upload-last-fm-data-neo4j-rneo4j-transactional-endpoint/

http://stackoverflow.com/questions/25295590/how-to-create-nodes-in-rneo4j-using-vectors-or-dataframes

http://stackoverflow.com/questions/25530538/java-heap-space-error-neo4j

http://www.slideshare.net/nurulferdous/nosql-is-it-for-you

http://stackoverflow.com/questions/25550711/convert-data-frame-to-json

http://www.browniethoughts.com/2013/02/nosql-databases-introduction.html

https://kvaes.wordpress.com/2015/01/21/database-variants-explained-sql-or-nosql-is-that-really-the-question/